### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [47]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [48]:
total_players = len(df["SN"].value_counts())
Number = pd.DataFrame({"Total Players":[total_players]})
Number

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [49]:
# number of unique items
items = len(df["Item ID"].value_counts())
unique = pd.DataFrame({"Number of Unique Items":[items]})
unique

   Number of Unique Items
0                     183

In [50]:
#Average Price
avg_price = df["Price"].mean()
price = pd.DataFrame({"Average Price":[avg_price]})
price

   Average Price
0       3.050987

In [51]:
# number of purchases
purchases = len(df["Purchase ID"].value_counts())
total_purchases = pd.DataFrame({"Number of Purchases":[purchases]})
total_purchases

   Number of Purchases
0                  780

In [52]:
# revenue
revenue = (df["Price"]).sum()
to_rev = pd.DataFrame({"Total Revenue":[revenue]})
to_rev

   Total Revenue
0        2379.77

In [53]:
display = pd.DataFrame({"Number of Unique Items":[items],
                       "Average Price":[avg_price],
                       "Number of Purchases":[purchases],
                       "Total Revenue":[revenue]})
display

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [54]:
# df by Gender
gender = df.groupby("Gender")
gender
gender_count = gender.nunique()["SN"]
gender_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [55]:
# gender divivde by total players 
percentage_of_players = gender_count / total_players * 100
percentage_of_players
gender_demographics = pd.DataFrame({"Percentage of Players": percentage_of_players, 
                                    "Total Count": gender_count})
gender_demographics

                       Percentage of Players  Total Count
Gender
Female                             14.062500           81
Male                               84.027778          484
Other / Non-Disclosed               1.909722           11

In [56]:
# Format the data/value
gender_demographics.index.name = None
gender_demographics.index.name 
gender_demographics.sort_values(["Total Count"], ascending = False).style.format(
                            {"Percentage of Players":"{:.2f}"})


## Purchasing Analysis (Gender)

Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender


Create a summary data frame to hold the results


Optional: give the displayed data cleaner formatting


Display the summary data frame

In [57]:
purchase_count = gender["Purchase ID"].count()

avg_purchase_price = gender["Price"].mean()

total_purchase_price = (gender["Price"]).sum()
     
avg_purchase_per_person = (avg_purchase_price/gender_count)

In [58]:
gender_analysis = pd.DataFrame({"Purchase Count":purchase_count,
                                   "Average Purchase Price":avg_purchase_price,
                                   "Total Purchase Value":total_purchase_price,
                                 "Avg Total Purchase per Person":avg_purchase_per_person})

gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.203009,361.94,0.039543
Male,652,3.017853,1967.64,0.006235
Other / Non-Disclosed,15,3.346000,50.19,0.304182

In [59]:
gender_analysis.index.name = "Gender"
gender_analysis.index.name

gender_analysis.style.format({"Avg Total Purchase per Person":"${:,.2f}",
                               "Total Purchase Value":"${:,.2f}",
                               "Average Purchase Price":"${:,.2f}"})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [60]:
bins = [0, 9.99, 14.99, 19.99, 24.99, 29.99, 34.99, 39.99, 9999.99]
group_age = ["<10", "10-14", "15-19", "20-24", "25-29","30-34", "35-39", "40+"]

In [61]:
df["Age Group"] = pd.cut(df["Age"], bins, labels=group_age)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [62]:
age = df.groupby("Age Group")
age_count = age.nunique()["SN"]

age_percentage = (age_count / total_players) * 100

In [63]:
age_demographics = pd.DataFrame({"Percentage of Players": age_percentage, 
                                    "Total Count": age_count})
age_demographics

           Percentage of Players  Total Count
Age Group
<10                     2.951389           17
10-14                   3.819444           22
15-19                  18.576389          107
20-24                  44.791667          258
25-29                  13.368056           77
30-34                   9.027778           52
35-39                   5.381944           31
40+                     2.083333           12

In [64]:
age_demographics.index.name = None
age_demographics.index.name

age_demographics.style.format({"Percentage of Players":"{:,.2f}"})

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [68]:
purchase_age_count = age["Purchase ID"].count()

avg_purchase_price_age = age["Price"].mean()

total_age_purchase_price = (age["Price"]).sum()
     
avg_purchase_per_person_age = (total_age_purchase_price/age_count)

In [69]:
age_analysis = pd.DataFrame({"Purchase Count":purchase_age_count,
                                   "Average Purchase Price":avg_purchase_price_age,
                                   "Total Purchase Value":total_age_purchase_price,
                                 "Avg Total Purchase per Person":avg_purchase_per_person_age})

age_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [70]:
age_analysis.style.format({"Avg Total Purchase per Person":"${:,.2f}",
                               "Total Purchase Value":"${:,.2f}",
                               "Average Purchase Price":"${:,.2f}"})

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [71]:
spender = df.groupby("SN")
spender_count = spender["Purchase ID"].count()
avg_spender_purchase = spender["Price"].mean()
total_spender_purchase = spender["Price"].sum()

In [72]:
top_spenders = pd.DataFrame({"Purchase Count":spender_count,
                       "Average Purchase Price":avg_spender_purchase,
                       "Total Purchases Value":total_spender_purchase})
top_spenders.head()

              Purchase Count  Average Purchase Price  Total Purchases Value
SN
Adairialis76               1                    2.28                   2.28
Adastirin33                1                    4.48                   4.48
Aeda94                     1                    4.91                   4.91
Aela59                     1                    4.32                   4.32
Aelaria33                  1                    1.79                   1.79

In [73]:
order = top_spenders.sort_values(["Total Purchases Value"], ascending = False)
order.head().style.format({"Total Purchases Value":"{:,.2f}",
                    "Average Purchase Price":"{:,.2f}"})

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [74]:
items_df = df[["Item ID", "Item Name", "Price"]] 
items_count = df.groupby(["Item ID", "Item Name"])
item_purchase_count = items_count["Price"].count()
purchase_value = (items_count["Price"]).sum()

items_price = (purchase_value/item_purchase_count)

In [76]:
popular_items = pd.DataFrame({"Purchase Count":item_purchase_count,
                       "Item Price":items_price,
                       "Total Purchases Value":purchase_value})
popular_items.head()

                            Purchase Count  Item Price  Total Purchases Value
Item ID Item Name
0       Splinter                         4        1.28                   5.12
1       Crucifer                         3        3.26                   9.78
2       Verdict                          6        2.48                  14.88
3       Phantomlight                     6        2.49                  14.94
4       Bloodlord's Fetish               5        1.70                   8.50

In [79]:
popular = popular_items.sort_values(["Purchase Count"], ascending = False)
popular.head()

,,Purchase Count,Item Price,Total Purchases Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [81]:
Most_Profitable = popular_items.sort_values(["Total Purchases Value"], ascending = False)
Most_Profitable.head()

,,Purchase Count,Item Price,Total Purchases Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80